gentoo.org
* Table                                                               :TOC_8:
- [[#安装][安装]]
    - [[#1挂载][1.挂载]]
    - [[#2stage3][2.stage3]]
      - [[#关于stage包的区别][关于stage包的区别]]
      - [[#解压stage3][解压stage3]]
      - [[#创建mntgentooetcportagereposconfgentooconf][创建/mnt/gentoo/etc/portage/repos.conf/gentoo.conf]]
      - [[#更改mntgentooetcgentooportagemakeconf][更改/mnt/gentoo/etc/gentoo/portage/make.conf]]
      - [[#二进制配置mntgentooetcgentooportagebinreposconfgentoobinhostconf][二进制配置/mnt/gentoo/etc/gentoo/portage/binrepos.conf/gentoobinhost.conf]]
      - [[#挂载文件系统][挂载文件系统]]
      - [[#chroot][chroot]]
      - [[#emerge-sync][emerge sync]]
      - [[#eselect][eselect]]
      - [[#配置use][配置use]]
      - [[#emerge-update][emerge update]]
      - [[#时区][时区]]
        - [[#openrc][openrc]]
        - [[#systemd][systemd]]
      - [[#locale-etclocalegen][locale /etc/locale.gen]]
      - [[#eselect-locale][eselect locale]]
      - [[#内核][内核]]
      - [[#rc][rc]]
      - [[#grub][grub]]
      - [[#umount][umount]]
      - [[#kde][kde]]
      - [[#display-manager][display-manager]]
      - [[#fcitx][fcitx]]
        - [[#etcenvironment][/etc/environment]]
      - [[#服务启动][服务启动]]
      - [[#kde-1][kde]]
    - [[#3grub][3.grub]]
      - [[#sys-bootos-prober][sys-boot/os-prober]]
    - [[#4网络][4.网络]]
      - [[#静态ip][静态ip]]
    - [[#5时间][5.时间]]
- [[#chroot安装][Chroot安装]]
- [[#后续][后续]]
  - [[#230版本更新][23.0版本更新]]
  - [[#fcitx-rime切换为简体][fcitx-rime切换为简体]]
  - [[#fcitx-1][fcitx]]
- [[#注意][注意]]
- [[#部分包配置][部分包配置]]
    - [[#www-clientgoogle-chrome][www-client/google-chrome]]
- [[#portage][portage]]
  - [[#emerge][emerge]]
    - [[#仓库更新][仓库更新]]
    - [[#删除包][删除包]]
    - [[#搜索包][搜索包]]
    - [[#安装包][安装包]]
    - [[#系统更新][系统更新]]
    - [[#包信息查询][包信息查询]]
    - [[#指定根][指定根]]
    - [[#清理缓存][清理缓存]]
    - [[#查看use说明][查看USE说明]]
    - [[#二进制包操作][二进制包操作]]
    - [[#报错][报错]]
      - [[#mask][mask]]
      - [[#use][USE]]
      - [[#循环依赖][循环依赖]]
      - [[#profile保护][profile保护]]
      - [[#测试版本][测试版本]]
      - [[#block][Block]]
      - [[#解决方案][解决方案]]
  - [[#gentoolkit][gentoolkit]]
    - [[#equery][equery]]
- [[#配置文件][配置文件]]
  - [[#sys][sys]]
    - [[#etcportagemakeconf][/etc/portage/make.conf]]
    - [[#etcportagereposconfgentooconf][/etc/portage/repos.conf/gentoo.conf]]
    - [[#etcportagebinreposconfgentoobinhostconf][/etc/portage/binrepos.conf/gentoobinhost.conf]]
    - [[#etcportagereposconfgentoo-zhconf][/etc/portage/repos.conf/gentoo-zh.conf]]
    - [[#etcgenkernelconf][/etc/genkernel.conf]]
  - [[#doc][doc]]
    - [[#vardbreposgentooprofilesusedesc][/var/db/repos/gentoo/profiles/use.desc]]
  - [[#packages][packages]]
    - [[#packageuse][package.use]]
      - [[#emacs][emacs]]
      - [[#ffmpeg][ffmpeg]]
      - [[#glibc][glibc]]
      - [[#qbittorrent][qbittorrent]]
      - [[#wine-proton][wine-proton]]
      - [[#rust][rust]]
      - [[#gcc][gcc]]
      - [[#libdrm][libdrm]]
    - [[#packageaccept_keywords][package.accept_keywords]]
      - [[#gentoo-zhxanmod-kernel][gentoo-zh/xanmod-kernel]]
- [[#应该安装的包][应该安装的包]]
- [[#问题][问题]]
- [[#ebuild][Ebuild]]
  - [[#标准变量variables][标准变量(variables)]]
  - [[#ebuild定义变量][Ebuild定义变量]]
    - [[#src_uri][SRC_URI]]
    - [[#required_use][REQUIRED_USE]]
  - [[#用户环境][用户环境]]
  - [[#skelebuild中文][skel.ebuild中文]]

* 安装
*** 1.挂载
将根磁盘挂载到/mnt/genoo
*** 2.stage3
**** 关于stage包的区别
| multilib 32 and 64  | 尽可能的使用64位库,必要时兼容32 |
| no-multilib (纯64位) | 除非必要 否则不要使用          |
| Openrc              | 一个简洁的init系统            |
| systemd             | 比openrc臃肿但通用            |
**** 解压stage3
:PROPERTIES:
:HEADER-ARGS: :tangle tangle/untar.sh :mkdirp yes
:END:
#+begin_src shell
  tar xpvf stage3-*.tar.xz --xattrs-include='*.*' --numeric-owner
#+end_src
**** 创建/mnt/gentoo/etc/portage/repos.conf/gentoo.conf
**** 更改/mnt/gentoo/etc/gentoo/portage/make.conf

**** 二进制配置/mnt/gentoo/etc/gentoo/portage/binrepos.conf/gentoobinhost.conf
**** 挂载文件系统
:PROPERTIES:
:HEADER-ARGS: :tangle tangle/mount.sh :mkdirp yes
:END:
- /proc是伪文件系统 由linux内核生成 挂载到/mnt/proc
- /sys是伪文件系统 类似/proc 更结构化
- /dev是包含全部设备文件的常规文件系统 一部分由linux设备管理器(通常是udev)  管理
/proc是挂载 /sys /dev /run是绑定挂载
例如 /mnt/sys就是sys(同一个文件系统的第二个条目) 而/mnt/proc(可以说)是文件系统的新挂载
#+begin_src shell
mount --types proc /proc /mnt/gentoo/proc
mount --rbind /sys /mnt/gentoo/sys
mount --make-rslave /mnt/gentoo/sys
mount --rbind /dev /mnt/gentoo/dev
mount --make-rslave /mnt/gentoo/dev
mount --bind /run /mnt/gentoo/run
mount --make-slave /mnt/gentoo/run
#+end_src
**** chroot
#+begin_src shell
  chroot /mnt/gentoo /bin/bash
  source /etc/profile
  export PS1="(chroot) &{PS1}"
#+end_src
**** emerge sync
#+begin_src shell
  emerge --sync
  
#+end_src
**** eselect
#+begin_src shell
  eselect news list
  eselect news read
  eselect profile list
  eselect profile set [number]
#+end_src
**** 配置use
#+begin_src shell
  emerge --info |grep ^USE #查看默认use
  vi /etc/portage/make.conf
#+end_src
**** emerge update
#+begin_src shell
  emerge --ask --verbose --update --deep --newuse @world
#+end_src
**** 时区
***** openrc
#+begin_src shell
  echo "Asia/Shanghai" > /etc/timezone
  emerge --config sys-libs/timezone-data
#+end_src
***** systemd
#+begin_src shell
  ln -sf /usr/share/zoneinfo/Asia/Shanghai /etc/localtime
#+end_src
**** locale /etc/locale.gen
#+begin_src gen
zh_CN.UTF-8 UTF-8
en_US.UTF-8 UTF-8

#+end_src
#+begin_src shell
  locale-gen
#+end_src
**** eselect locale
#+begin_src shell
  eselect locale list #找到zh_CN.utf8
  eselect locale set

#+end_src

**** 内核
#+begin_src shell

  emerge linux-firmware
  emerge gentoo-sources
  emerge genkernel
  time genkernel all

#+end_src
**** rc
#+begin_src shell
  emerge dhcpcd
  emerge networkmanager
  emerge syslog-ng
  emerge cronie
  emerge virtual/sshd
  rc-update add dhcpcd default
  rc-update add syslog-ng default
  rc-update add sshd default
  rc-update add cronie default
  emerge sudo
  useradd -m donjuan
  passwd donjuan
  
#+end_src
**** grub
#+begin_src shell
  emerge sys-boot/grub
  grub-install --target=x86_64-efi --efi-directory=/efi --removable
  grub-mkconfig -o /boot
#+end_src

**** umount
#+begin_src shell
  umount /mnt/gentoo/dev
  umount /mnt/gentoo/proc
  umount /mnt/gentoo/efi
  umount /mnt/gentoo
#+end_src

**** kde
#+begin_src shell
  emerge dev-libs/plasma-wayland-protocols-1.10.0
  emerge dev-libs/wayland-1.22.0
  emerge dev-libs/wayland-protocols-1.32
  emerge sddm
  emerge plasma-meta
  emerge kde-plasma/kwalletmanager
#+end_src
**** display-manager
注意 也可以直接用dbus启动
#+begin_src shell
  dbus-launch startplasma-wayland
#+end_src

使用sddm
#+begin_src shell
   emerge gui-libs/display-manager-init
   vi /etc/conf.d/xdm
   vi /etc/conf.d/display-manager
  ->  DISPLAYMANAGER="sddm"
   sudo rc-update add sddm default
#+end_src
**** fcitx
#+begin_src
echo 'app-i18n/fcitx-configtool kcm' > /etc/portage/package.use/fcitx-configtool
emerge fcitx fcitx-rime fcitx-configtools
#+end_src
在键盘->虚拟键盘 选择fcitx5

在输入法->添加输入法 添加中州韵
***** /etc/environment
:PROPERTIES:
:HEADER-ARGS: :tangle etc/environment :mkdirp yes
:END:
#+begin_src shell
  #
  # This file is parsed by pam_env module
  #
  # Syntax: simple "KEY=VAL" pairs on separate lines
  #
  QT_IM_MODULE="fcitx"
  GTK_IM_MODULE="fcitx"
  XMODIFIERS="@im=fcitx"

#+end_src
#+begin_src shell
  emerge fcitx fcitx-libpinyin fcitx-qt5 kcm-fcitx libpinyin
#+end_src
**** 服务启动
#+begin_src shell
sudo emerge alsa-utils
sudo emerge alsa-plugins

sudo rc-update add udev sysinit
sudo rc-update add elogind boot
sudo rc-update add dbus default
sudo rc-update add alsasound boot
sudo rc-update add Networkmanager default
#+end_src
**** kde
#+begin_src ~/.profile
  dbus-launch --exit-with-session startplasma-wayland
#+end_src

*** 3.grub
#+begin_src shell
  emerge grub
  GRUB_TIMEOUT=10
  grub install --target=x86_64-efi --removable --efi-directory=/boot/EFI # EFI
#+end_src
**** sys-boot/os-prober
GRUB 可以在运行 grub-mkconfig 命令时检测到其他操作系统并生成启动项
#+begin_src shell
  emerge --ask --newuse sys-boot/os-prober
#+end_src

*** 4.网络
**** 静态ip
/etc/dhcpcd.conf
#+begin_src shell
  static ip_address=192.168.0.10/24
  static routers=192.168.0.1
  static domain_name_servers=192.168.0.1
#+end_src
*** 5.时间
#+begin_src shell
  sudo emerge net-misc/chrony
  rc-update add chronyd default
#+end_src

* Chroot安装
* 后续
** 23.0版本更新
默认合并了/usr (merged-usr)
在profile中 旧版本需要选择 split-usr
#+begin_src
  Select the 23.0 profile corresponding to your current profile, either using
   "eselect profile" or by manually setting the profile symlink.
   Note that old profiles are by default split-usr and the 23.0 profiles by
   default merged-usr. Do NOT change directory scheme now, since this will
   mess up your system! 
   Instead, make sure that the new profile has the same property: for example, 
   OLD default/linux/amd64/17.1  
        ==>  NEW default/linux/amd64/23.0/split-usr
             (added "split-usr")
   OLD default/linux/amd64/17.1/systemd/merged-usr  
        ==>  NEW default/linux/amd64/23.0/systemd
             (removed "merged-usr")

#+end_src
** fcitx-rime切换为简体
F4选择即可

** fcitx

* 注意
更新后记得执行 因为gentoo有时更新会换一些库的位置 dispatch-conf可以帮助你迁移配置文件
#+begin_src shell
  dispatch-conf
#+end_src
* 部分包配置
*** www-client/google-chrome
安装好后在chrome://flags中Preferred Ozone platform选择wayland
* portage
** emerge
*** 仓库更新
#+begin_src shell
  emerge --sync # 更新仓库
#+end_src
