cs/gentoo/gentoo.md



<a id="org2f84ce5"></a>

# 安装


<a id="org2af0dd7"></a>

### 1.挂载

将根磁盘挂载到/mnt/genoo


<a id="org4294f57"></a>

### 2.stage3

1.  关于stage包的区别

    <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
    
    
    <colgroup>
    <col  class="org-left" />
    
    <col  class="org-left" />
    </colgroup>
    <tbody>
    <tr>
    <td class="org-left">multilib 32 and 64</td>
    <td class="org-left">尽可能的使用64位库,必要时兼容32</td>
    </tr>
    
    <tr>
    <td class="org-left">no-multilib (纯64位)</td>
    <td class="org-left">除非必要 否则不要使用</td>
    </tr>
    
    <tr>
    <td class="org-left">Openrc</td>
    <td class="org-left">一个简洁的init系统</td>
    </tr>
    
    <tr>
    <td class="org-left">systemd</td>
    <td class="org-left">比openrc臃肿但通用</td>
    </tr>
    </tbody>
    </table>

2.  解压stage3

        tar xpvf stage3-*.tar.xz --xattrs-include='*.*' --numeric-owner

3.  创建/mnt/gentoo/etc/portage/repos.conf/gentoo.conf

4.  更改/mnt/gentoo/etc/gentoo/portage/make.conf

5.  二进制配置/mnt/gentoo/etc/gentoo/portage/binrepos.conf/gentoobinhost.conf

6.  挂载文件系统

    -   /proc是伪文件系统 由linux内核生成 挂载到/mnt/proc
    -   /sys是伪文件系统 类似/proc 更结构化
    -   /dev是包含全部设备文件的常规文件系统 一部分由linux设备管理器(通常是udev)  管理
    
    /proc是挂载 /sys /dev /run是绑定挂载
    例如 /mnt/sys就是sys(同一个文件系统的第二个条目) 而/mnt/proc(可以说)是文件系统的新挂载
    
        mount --types proc /proc /mnt/gentoo/proc
        mount --rbind /sys /mnt/gentoo/sys
        mount --make-rslave /mnt/gentoo/sys
        mount --rbind /dev /mnt/gentoo/dev
        mount --make-rslave /mnt/gentoo/dev
        mount --bind /run /mnt/gentoo/run
        mount --make-slave /mnt/gentoo/run

7.  chroot

        chroot /mnt/gentoo /bin/bash
        source /etc/profile
        export PS1="(chroot) &{PS1}"

8.  emerge sync

        emerge --sync

9.  eselect

        eselect news list
        eselect news read
        eselect profile list
        eselect profile set [number]

10. 配置use

        emerge --info |grep ^USE #查看默认use
        vi /etc/portage/make.conf

11. emerge update

        emerge --ask --verbose --update --deep --newuse @world

12. 时区

    1.  openrc
    
            echo "Asia/Shanghai" > /etc/timezone
            emerge --config sys-libs/timezone-data
    
    2.  systemd
    
            ln -sf /usr/share/zoneinfo/Asia/Shanghai /etc/localtime

13. locale /etc/locale.gen

        zh_CN.UTF-8 UTF-8
        en_US.UTF-8 UTF-8
    
        locale-gen

14. eselect locale

        eselect locale list #找到zh_CN.utf8
        eselect locale set

15. 内核

        
        emerge linux-firmware
        emerge gentoo-sources
        emerge genkernel
        time genkernel all

16. rc

        emerge dhcpcd
        emerge networkmanager
        emerge syslog-ng
        emerge cronie
        emerge virtual/sshd
        rc-update add dhcpcd default
        rc-update add syslog-ng default
        rc-update add sshd default
        rc-update add cronie default
        emerge sudo
        useradd -m donjuan
        passwd donjuan

17. grub

        emerge sys-boot/grub
        grub-install --target=x86_64-efi --efi-directory=/efi --removable
        grub-mkconfig -o /boot

18. umount

        umount /mnt/gentoo/dev
        umount /mnt/gentoo/proc
        umount /mnt/gentoo/efi
        umount /mnt/gentoo

19. kde

        emerge dev-libs/plasma-wayland-protocols-1.10.0
        emerge dev-libs/wayland-1.22.0
        emerge dev-libs/wayland-protocols-1.32
        emerge sddm
        emerge plasma-meta
        emerge kde-plasma/kwalletmanager

20. display-manager

    注意 也可以直接用dbus启动
    
        dbus-launch startplasma-wayland
    
    使用sddm
    
         emerge gui-libs/display-manager-init
         vi /etc/conf.d/xdm
         vi /etc/conf.d/display-manager
        ->  DISPLAYMANAGER="sddm"
         sudo rc-update add sddm default

21. fcitx

        echo 'app-i18n/fcitx-configtool kcm' > /etc/portage/package.use/fcitx-configtool
        emerge fcitx fcitx-rime fcitx-configtools
    
    在键盘->虚拟键盘 选择fcitx5
    
    在输入法->添加输入法 添加中州韵
    
    1.  /etc/environment
    
            #
            # This file is parsed by pam_env module
            #
            # Syntax: simple "KEY=VAL" pairs on separate lines
            #
            QT_IM_MODULE="fcitx"
            GTK_IM_MODULE="fcitx"
            XMODIFIERS="@im=fcitx"
        
            emerge fcitx fcitx-libpinyin fcitx-qt5 kcm-fcitx libpinyin

22. 服务启动

        sudo emerge alsa-utils
        sudo emerge alsa-plugins
        
        sudo rc-update add udev sysinit
        sudo rc-update add elogind boot
        sudo rc-update add dbus default
        sudo rc-update add alsasound boot
        sudo rc-update add Networkmanager default

23. kde

        dbus-launch --exit-with-session startplasma-wayland


<a id="org42afcc0"></a>

### 3.grub

    emerge grub
    GRUB_TIMEOUT=10
    grub install --target=x86_64-efi --removable --efi-directory=/boot/EFI # EFI

1.  sys-boot/os-prober

    GRUB 可以在运行 grub-mkconfig 命令时检测到其他操作系统并生成启动项
    
        emerge --ask --newuse sys-boot/os-prober


<a id="orgbbbfab8"></a>

### 4.网络

1.  静态ip

    /etc/dhcpcd.conf
    
        static ip_address=192.168.0.10/24
        static routers=192.168.0.1
        static domain_name_servers=192.168.0.1


<a id="org3a59196"></a>

### 5.时间

    sudo emerge net-misc/chrony
    rc-update add chronyd default


<a id="org4eb373e"></a>

# Chroot安装


<a id="org6bab371"></a>

# 后续


<a id="org429572b"></a>

## 23.0版本更新

默认合并了/usr (merged-usr)
在profile中 旧版本需要选择 split-usr

    Select the 23.0 profile corresponding to your current profile, either using
     "eselect profile" or by manually setting the profile symlink.
     Note that old profiles are by default split-usr and the 23.0 profiles by
     default merged-usr. Do NOT change directory scheme now, since this will
     mess up your system! 
     Instead, make sure that the new profile has the same property: for example, 
     OLD default/linux/amd64/17.1  
          ==>  NEW default/linux/amd64/23.0/split-usr
               (added "split-usr")
     OLD default/linux/amd64/17.1/systemd/merged-usr  
          ==>  NEW default/linux/amd64/23.0/systemd
               (removed "merged-usr")


<a id="org18ed822"></a>

## fcitx-rime切换为简体

F4选择即可


<a id="org0e29b8f"></a>

## fcitx


<a id="orgf6cbb0e"></a>

# 注意

更新后记得执行 因为gentoo有时更新会换一些库的位置 dispatch-conf可以帮助你迁移配置文件

    dispatch-conf


<a id="org3847814"></a>

# 部分包配置


<a id="org72ffef1"></a>

### www-client/google-chrome

安装好后在chrome://flags中Preferred Ozone platform选择wayland


<a id="org854e0e6"></a>

# portage


<a id="org765bb86"></a>

## emerge


<a id="org1c06e57"></a>

### 仓库更新

    emerge --sync # 更新仓库
