gentoo.org
*** 删除包
#+begin_src shell
  emerge --unmerge package
  emerge --deselect package
  emerge --depclean
#+end_src
*** 搜索包
#+begin_src shell
  emerge --search package # 搜索包名
  emerge --searchdesc package # 搜索包的描述
#+end_src
*** 安装包
#+begin_src shell
  emerge package
  emerge --pretend package # 查看依赖
  emerge --fetchonly package # 仅下载源代码至/var/cache/distfiles
  emerge =package-version # 安装指定版本
#+end_src
*** 系统更新
#+begin_src shell
  emerge --update --deep --newuse @world
#+end_src
*** 包信息查询
#+begin_src shell
  emerge -vp package
#+end_src
你将会看到 类似于
#+begin_src shell
  [ebuild  rR    ] kde-plasma/plasma-desktop-6.2.4:6::gentoo  USE="handbook screencast sdl semantic-desktop -debug -ibus -scim -test -webengine" INPUT_DEVICES="-wacom" 0 KiB

#+end_src
其中在[]里
#+begin_src 
  N new包
  S SLOT安装(并排版本)
  U 更新
  D 降级
  r 重新安装(由于某种原因被强制安装)
  R 替换(重新安装相同的版本)
  I 交互式
  B 由于未解决的冲突被block
  b 被block 但是自动解决冲突
#+end_src
其中在USE后
#+begin_src
  -USE 没有激活这个USE
  USE* 状态转换
  UES% 新增加的或减少的
  (USE) 强制的
  {} 被绑定于FEATURES
#+end_src
*** 指定根
#+begin_src shell
  emerge --root=DIR # 指定ROOT env
  emerge --sysroot=DIR # 指定SYSROOT env
#+end_src
*** 清理缓存
#+begin_src shell
    eclean-dist
#+end_src
*** 查看USE说明
安装gentoolkit
#+begin_src shell
  equery uses emacs
   * Found these USE flags for app-editors/emacs-29.4:
 U I
 + + X                   : Add support for X11
 - - Xaw3d               : Add support for the 3d athena widget set
 + + acl                 : Add support for Access Control Lists
 + + alsa                : Add support for media-libs/alsa-lib (Advanced Linux Sound Architecture)
 - - athena              : Enable the MIT Athena widget set (x11-libs/libXaw)
 + + cairo               : Enable support for the cairo graphics library
 + + dbus                : Enable dbus support for anything that needs it (gpsd, gnomemeeting, etc)
 + + dynamic-loading     : Enable loading of dynamic libraries (modules) at runtime
 - - games               : Support shared score files for games
....
#+end_src

*** 二进制包操作
#+begin_src shell
  emerge -g # 从远程下载二进制包 若没有则编译
  emerge -G # 从远程下载二进制包 若没有则报错
#+end_src
*** 报错
**** mask
| ~arch keyword               | 该软件没有经过充分的测试 不能进入稳定分支 请等待一段时间后尝试使用                                                                |
| -arch keyword or -* keyword | 该软件不能在目标机器的架构中工作 如果情况并非如此                                                                              |
| missing keyword             | 该软件至今还没有在机器的架构中进行过测试 可以咨询相应架构移植小组是否能对它进行测试 查看 /etc/portage/package.accept_keywords 和接受单个软件包的关键字 |
| package.mask                | 发现该包已损坏或其他问题 被故意标记为请勿使用                                                                                  |
| profile                     | 该软件不适合当前proifle                                                                                                  |
| license                     | 不兼容license                                                                                                         |
**** USE
portage提示USE需要更改
#+begin_src shell
  The following USE changes are necessary to proceed:
  #required by app-text/happypackage-2.0, required by happypackage (argument)
  >=app-text/feelings-1.0.0 test
#+end_src
遇到这种情况 请到/etc/portage/package.use设置包
**** 循环依赖
#+begin_src shell
  !!! Error: circular dependencies: 
  ebuild / net-print/cups-1.1.15-r2 depends on ebuild / app-text/ghostscript-7.05.3-r1
  ebuild / app-text/ghostscript-7.05.3-r1 depends on ebuild / net-print/cups-1.1.15-r2
#+end_src
此时应该静待portage更新并反馈bug
**** profile保护
#+begin_src shell
  !!! Trying to unmerge package(s) in system profile. 'sys-apps/portage'
  !!! This could be damaging to your system.
#+end_src
您要求移除系统核心软件包中的一个 它是您的profile中所列出的必需的软件 因此不能从系统中移除 

**** 测试版本
类似于
#+begin_src
  masked by: ~amd64 keyword
#+end_src

此时编籍/etc/portage/package.accept_keywords/package
并添加xxx/package ~amd64
**** Block
示例
#+begin_src shell
[ebuild  N     ] x11-libs/xcb-imdkit-1.0.9 
[ebuild  NS    ] app-i18n/fcitx-5.1.10 [4.2.9.8] USE="emoji%* keyboard%* server%* wayland%* -doc% -presage% -systemd%" 
[blocks B      ] app-i18n/fcitx:4 ("app-i18n/fcitx:4" is soft blocking app-i18n/fcitx-5.1.10)
[blocks B      ] app-i18n/fcitx:5 ("app-i18n/fcitx:5" is soft blocking app-i18n/fcitx-4.2.9.8)

 * Error: The above package list contains packages which cannot be
 * installed at the same time on the same system.

  (app-i18n/fcitx-4.2.9.8:4/4::gentoo, installed) pulled in by
    >=app-i18n/fcitx-4.2.9:4 required by (app-i18n/kcm-fcitx-0.5.6:4-plasma5/4-plasma5::gentoo, installed) USE="" ABI_X86="(64)"
    >=app-i18n/fcitx-4.2.9:4 required by (app-i18n/fcitx-rime-0.3.2-r1:4/4::gentoo, installed) USE="" ABI_X86="(64)"
    >=app-i18n/fcitx-4.2.9:4 required by (app-i18n/fcitx-qt5-1.2.5:4/4::gentoo, installed) USE="" ABI_X86="(64)"
    >=app-i18n/fcitx-4.2.9:4 required by (app-i18n/fcitx-libpinyin-0.5.4:4/4::gentoo, installed) USE="-dictionary-manager" ABI_X86="(64)"

  (app-i18n/fcitx-5.1.10:5/5::gentoo, ebuild scheduled for merge) pulled in by
    fcitx


For more information about Blocked Packages, please refer to the following
section of the Gentoo Linux x86 Handbook (architecture is irrelevant):

https://wiki.gentoo.org/wiki/Handbook:X86/Working/Portage#Blocked_packages

#+end_src
**** 解决方案
为了使安装得以继续进行，您可以选择不安装这个软件包，或者先将发生冲突的包卸载。
你也可能会遇到某些特定版本的包被屏蔽的情况，比如<media-video/mplayer-1.0_rc1-r2。在这种情况下，升级到一个更新的版本就能解决问题。 

** gentoolkit
安装
#+begin_src shell
  emerge gentoolkit
#+end_src

*** equery
查看依赖于这个包的所有包
#+begin_src shell
  equery depends -D package
#+end_src
查看这个包依赖什么包
#+begin_src shell
  equery depgraph package
#+end_src
* 配置文件

** sys
*** /etc/portage/make.conf
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/make.conf :mkdirp yes
:END:
#+begin_src conf

	# These settings were set by the catalyst build script that automatically
  # built this stage.
  # Please consult /usr/share/portage/config/make.conf.example for a more
  # detailed example.
  COMMON_FLAGS="-O2 -pipe"
  CFLAGS="${COMMON_FLAGS}"
  CXXFLAGS="${COMMON_FLAGS}"
  FCFLAGS="${COMMON_FLAGS}"
  FFLAGS="${COMMON_FLAGS}"
  FEATURES="${FEATURES} binpkg-request-signature buildpkg"
  # NOTE: This stage was built with the bindist Use flag enabled

  # This sets the language of build output to English.
  # Please keep this setting intact when reporting bugs.
  LC_MESSAGES=C.utf8
  GENTOO_MIRRORS="rsync://127.0.0.1/repo/gentoo/"
  #GENTOO_MIRRORS="rsync://mirror.nju.edu.cn/gentoo/"
  USE="-gnome wayland  qt5 kde dvd cdr acl alsa jack pulseaudio bluetooth wayland browser-integration discover networkmanager sddm"
  VIDEO_CARDS="amdgpu radeonsi"
  MAKEOPTS="-j8"


  # ccache
  #FEATURES="ccache -test"
  #CCACHE_DIR="/var/cache/ccache"

  GRUB_PLATFORMS="efi-64"

  ACCEPT_LICENSE="*"

  ALSA_CARDS="hda_intel"

  L10N="en-US zh-CN en zh"
  ABI_X86="32 64"	      
#+end_src

*** /etc/portage/repos.conf/gentoo.conf
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/repos.conf/gentoo.conf :mkdirp yes
:END:
#+begin_src shell
[DEFAULT]
main-repo = gentoo

[gentoo]
location = /var/db/repos/gentoo
sync-type = rsync
#sync-uri = rsync://127.0.0.1/repo/gentoo-portage
sync-uri = rsync://mirrors.tuna.tsinghua.edu.cn/gentoo-portage
auto-sync = yes
sync-rsync-verify-jobs = 1
sync-rsync-verify-metamanifest = no
sync-rsync-verify-max-age = 24
sync-openpgp-key-path = /usr/share/openpgp-keys/gentoo-release.asc
sync-openpgp-key-refresh-retry-count = 40
sync-openpgp-key-refresh-retry-overall-timeout = 1200
sync-openpgp-key-refresh-retry-delay-exp-base = 2
sync-openpgp-key-refresh-retry-delay-max = 60
sync-openpgp-key-refresh-retry-delay-mult = 4
sync-webrsync-verify-signature = no

#+end_src

