cs/gentoo/gentoo.md


<a id="org79772ce"></a>

### 删除包

    emerge --unmerge package
    emerge --deselect package
    emerge --depclean


<a id="org5645537"></a>

### 搜索包

    emerge --search package # 搜索包名
    emerge --searchdesc package # 搜索包的描述


<a id="org29c2b61"></a>

### 安装包

    emerge package
    emerge --pretend package # 查看依赖
    emerge --fetchonly package # 仅下载源代码至/var/cache/distfiles
    emerge =package-version # 安装指定版本


<a id="org1ab55c6"></a>

### 系统更新

    emerge --update --deep --newuse @world


<a id="org651a091"></a>

### 包信息查询

    emerge -vp package

你将会看到 类似于

    [ebuild  rR    ] kde-plasma/plasma-desktop-6.2.4:6::gentoo  USE="handbook screencast sdl semantic-desktop -debug -ibus -scim -test -webengine" INPUT_DEVICES="-wacom" 0 KiB

其中在[]里

    N new包
    S SLOT安装(并排版本)
    U 更新
    D 降级
    r 重新安装(由于某种原因被强制安装)
    R 替换(重新安装相同的版本)
    I 交互式
    B 由于未解决的冲突被block
    b 被block 但是自动解决冲突

其中在USE后

    -USE 没有激活这个USE
    USE* 状态转换
    UES% 新增加的或减少的
    (USE) 强制的
    {} 被绑定于FEATURES


<a id="orgda4757f"></a>

### 指定根

    emerge --root=DIR # 指定ROOT env
    emerge --sysroot=DIR # 指定SYSROOT env


<a id="org614fe1b"></a>

### 清理缓存

    eclean-dist


<a id="org96b1a04"></a>

### 查看USE说明

安装gentoolkit

      equery uses emacs
       * Found these USE flags for app-editors/emacs-29.4:
     U I
     + + X                   : Add support for X11
     - - Xaw3d               : Add support for the 3d athena widget set
     + + acl                 : Add support for Access Control Lists
     + + alsa                : Add support for media-libs/alsa-lib (Advanced Linux Sound Architecture)
     - - athena              : Enable the MIT Athena widget set (x11-libs/libXaw)
     + + cairo               : Enable support for the cairo graphics library
     + + dbus                : Enable dbus support for anything that needs it (gpsd, gnomemeeting, etc)
     + + dynamic-loading     : Enable loading of dynamic libraries (modules) at runtime
     - - games               : Support shared score files for games
    ....


<a id="org561a4a8"></a>

### 二进制包操作

    emerge -g # 从远程下载二进制包 若没有则编译
    emerge -G # 从远程下载二进制包 若没有则报错


<a id="orga67eca7"></a>

### 报错

1.  mask

    <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
    
    
    <colgroup>
    <col  class="org-left" />
    
    <col  class="org-left" />
    </colgroup>
    <tbody>
    <tr>
    <td class="org-left">~arch keyword</td>
    <td class="org-left">该软件没有经过充分的测试 不能进入稳定分支 请等待一段时间后尝试使用</td>
    </tr>
    
    <tr>
    <td class="org-left">-arch keyword or -* keyword</td>
    <td class="org-left">该软件不能在目标机器的架构中工作 如果情况并非如此</td>
    </tr>
    
    <tr>
    <td class="org-left">missing keyword</td>
    <td class="org-left">该软件至今还没有在机器的架构中进行过测试 可以咨询相应架构移植小组是否能对它进行测试 查看 /etc/portage/package.accept<sub>keywords</sub> 和接受单个软件包的关键字</td>
    </tr>
    
    <tr>
    <td class="org-left">package.mask</td>
    <td class="org-left">发现该包已损坏或其他问题 被故意标记为请勿使用</td>
    </tr>
    
    <tr>
    <td class="org-left">profile</td>
    <td class="org-left">该软件不适合当前proifle</td>
    </tr>
    
    <tr>
    <td class="org-left">license</td>
    <td class="org-left">不兼容license</td>
    </tr>
    </tbody>
    </table>

2.  USE

    portage提示USE需要更改
    
        The following USE changes are necessary to proceed:
        #required by app-text/happypackage-2.0, required by happypackage (argument)
        >=app-text/feelings-1.0.0 test
    
    遇到这种情况 请到/etc/portage/package.use设置包

3.  循环依赖

        !!! Error: circular dependencies: 
        ebuild / net-print/cups-1.1.15-r2 depends on ebuild / app-text/ghostscript-7.05.3-r1
        ebuild / app-text/ghostscript-7.05.3-r1 depends on ebuild / net-print/cups-1.1.15-r2
    
    此时应该静待portage更新并反馈bug

4.  profile保护

        !!! Trying to unmerge package(s) in system profile. 'sys-apps/portage'
        !!! This could be damaging to your system.
    
    您要求移除系统核心软件包中的一个 它是您的profile中所列出的必需的软件 因此不能从系统中移除 

5.  测试版本

    类似于
    
        masked by: ~amd64 keyword
    
    此时编籍/etc/portage/package.accept<sub>keywords</sub>/package
    并添加xxx/package ~amd64

6.  Block

    示例
    
        [ebuild  N     ] x11-libs/xcb-imdkit-1.0.9 
        [ebuild  NS    ] app-i18n/fcitx-5.1.10 [4.2.9.8] USE="emoji%* keyboard%* server%* wayland%* -doc% -presage% -systemd%" 
        [blocks B      ] app-i18n/fcitx:4 ("app-i18n/fcitx:4" is soft blocking app-i18n/fcitx-5.1.10)
        [blocks B      ] app-i18n/fcitx:5 ("app-i18n/fcitx:5" is soft blocking app-i18n/fcitx-4.2.9.8)
        
         * Error: The above package list contains packages which cannot be
         * installed at the same time on the same system.
        
          (app-i18n/fcitx-4.2.9.8:4/4::gentoo, installed) pulled in by
            >=app-i18n/fcitx-4.2.9:4 required by (app-i18n/kcm-fcitx-0.5.6:4-plasma5/4-plasma5::gentoo, installed) USE="" ABI_X86="(64)"
            >=app-i18n/fcitx-4.2.9:4 required by (app-i18n/fcitx-rime-0.3.2-r1:4/4::gentoo, installed) USE="" ABI_X86="(64)"
            >=app-i18n/fcitx-4.2.9:4 required by (app-i18n/fcitx-qt5-1.2.5:4/4::gentoo, installed) USE="" ABI_X86="(64)"
            >=app-i18n/fcitx-4.2.9:4 required by (app-i18n/fcitx-libpinyin-0.5.4:4/4::gentoo, installed) USE="-dictionary-manager" ABI_X86="(64)"
        
          (app-i18n/fcitx-5.1.10:5/5::gentoo, ebuild scheduled for merge) pulled in by
            fcitx
        
        
        For more information about Blocked Packages, please refer to the following
        section of the Gentoo Linux x86 Handbook (architecture is irrelevant):
        
        https://wiki.gentoo.org/wiki/Handbook:X86/Working/Portage#Blocked_packages

7.  解决方案

    为了使安装得以继续进行，您可以选择不安装这个软件包，或者先将发生冲突的包卸载。
    你也可能会遇到某些特定版本的包被屏蔽的情况，比如<media-video/mplayer-1.0<sub>rc1</sub>-r2。在这种情况下，升级到一个更新的版本就能解决问题。 


<a id="orgf70a598"></a>

## gentoolkit

安装

    emerge gentoolkit


<a id="org2e8e93f"></a>

### equery

查看依赖于这个包的所有包

    equery depends -D package

查看这个包依赖什么包

    equery depgraph package


<a id="org90eaac3"></a>

# 配置文件


<a id="org1017673"></a>

## sys


<a id="org626991f"></a>

### /etc/portage/make.conf

    
            # These settings were set by the catalyst build script that automatically
    # built this stage.
    # Please consult /usr/share/portage/config/make.conf.example for a more
    # detailed example.
    COMMON_FLAGS="-O2 -pipe"
    CFLAGS="${COMMON_FLAGS}"
    CXXFLAGS="${COMMON_FLAGS}"
    FCFLAGS="${COMMON_FLAGS}"
    FFLAGS="${COMMON_FLAGS}"
    FEATURES="${FEATURES} binpkg-request-signature buildpkg"
    # NOTE: This stage was built with the bindist Use flag enabled
    
    # This sets the language of build output to English.
    # Please keep this setting intact when reporting bugs.
    LC_MESSAGES=C.utf8
    #GENTOO_MIRRORS="rsync://127.0.0.1/repo/gentoo/"
    GENTOO_MIRRORS="rsync://mirror.nju.edu.cn/gentoo/"
    USE="-gnome wayland  qt5 kde dvd cdr acl alsa jack pulseaudio bluetooth wayland browser-integration discover networkmanager  pipewire  screencast plasma grub"
    VIDEO_CARDS="amdgpu radeonsi"
    MAKEOPTS="-j8"
    
    
    # ccache
    #FEATURES="ccache -test"
    #CCACHE_DIR="/var/cache/ccache"
    
    GRUB_PLATFORMS="efi-64"
    
    ACCEPT_LICENSE="*"
    
    ALSA_CARDS="hda_intel"
    
    L10N="en-US zh-CN en zh"
    ABI_X86="32 64"	      


<a id="orgd2d9671"></a>

### /etc/portage/repos.conf/gentoo.conf

    [DEFAULT]
    main-repo = gentoo
    
    [gentoo]
    location = /var/db/repos/gentoo
    sync-type = rsync
    #sync-uri = rsync://127.0.0.1/repo/gentoo-portage
    sync-uri = rsync://mirrors.tuna.tsinghua.edu.cn/gentoo-portage
    auto-sync = yes
    sync-rsync-verify-jobs = 1
    sync-rsync-verify-metamanifest = no
    sync-rsync-verify-max-age = 24
    sync-openpgp-key-path = /usr/share/openpgp-keys/gentoo-release.asc
    sync-openpgp-key-refresh-retry-count = 40
    sync-openpgp-key-refresh-retry-overall-timeout = 1200
    sync-openpgp-key-refresh-retry-delay-exp-base = 2
    sync-openpgp-key-refresh-retry-delay-max = 60
    sync-openpgp-key-refresh-retry-delay-mult = 4
    sync-webrsync-verify-signature = no
