gentoo.org
*** /etc/portage/binrepos.conf/gentoobinhost.conf
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/binrepos.conf/gentoobinhost.conf :mkdirp yes
:END:
#+begin_src shell
  # These settings were set by the catalyst build script that automatically
# built this stage.
# Please consider using a local mirror.

[gentoobinhost]
priority = 1
sync-uri = https://mirrors.tuna.tsinghua.edu.cn/gentoo/releases/amd64/binpackages/23.0/x86-64

#+end_src
*** /etc/portage/repos.conf/gentoo-zh.conf
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/repos.conf/gentoo-zh.conf :mkdirp yes
:END:
#+begin_src shell
  # created by eselect-repo
[gentoo-zh]
location = /var/db/repos/gentoo-zh
sync-type = git
sync-uri = https://github.com/microcai/gentoo-zh.git
#+end_src
