cs/gentoo/gentoo.md


<a id="orgad1d3e9"></a>

### /etc/portage/binrepos.conf/gentoobinhost.conf

      # These settings were set by the catalyst build script that automatically
    # built this stage.
    # Please consider using a local mirror.
    
    [gentoobinhost]
    priority = 1
    sync-uri = https://mirrors.tuna.tsinghua.edu.cn/gentoo/releases/amd64/binpackages/23.0/x86-64


<a id="orgbb0d5e4"></a>

### /etc/portage/repos.conf/gentoo-zh.conf

      # created by eselect-repo
    [gentoo-zh]
    location = /var/db/repos/gentoo-zh
    sync-type = git
    sync-uri = https://github.com/microcai/gentoo-zh.git
