gentoo.org
** packages
*** package.use
**** emacs
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/package.use/emacs :mkdirp yes
:END:
#+begin_src shell
  app-editors/emacs libxml2 dynamic-loading json xwidgets
#+end_src

**** ffmpeg
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/package.use/ffmpeg :mkdirp yes
:END:
#+begin_src shell
  media-video/ffmpeg libass opus vpx
#+end_src

**** glibc
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/package.use/glibc :mkdirp yes
:END:
#+begin_src shell
  sys-libs/glibc hash-sysv-compat
#+end_src

**** qbittorrent
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/package.use/qbittorrent :mkdirp yes
:END:
#+begin_src shell
  net-p2p/qbittorrent gui webui
#+end_src

**** wine-proton
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/package.use/wine-proton :mkdirp yes
:END:
#+begin_src shell
  app-emulation/wine-proton osmesa v4l
#+end_src

**** rust
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/package.use/rust :mkdirp yes
:END:
#+begin_src shell
dev-lang/rust  clippy doc rust-analyzer rust-src rust-fmt
dev-lang/rust-bin clippy rust-src rust-analyzer rustfmt

#+end_src

**** gcc
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/package.use/gcc :mkdirp yes
:END:
#+begin_src shell
sys-devel/gcc jit
#+end_src

**** libdrm
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/package.use/libdrm :mkdirp yes
:END:
#+begin_src shell
  x11-libs/libdrm video_cards_radeon
#+end_src

*** package.accept_keywords
**** gentoo-zh/xanmod-kernel
:PROPERTIES:
:HEADER-ARGS: :tangle etc/portage/package.accept_keywords/xanmod-kernel :mkdirp yes
:END:
#+begin_src shell
  sys-kernel/xanmod-kernel ~amd64
#+end_src
* 应该安装的包
#+begin_src shell
  fcitx-gtk
#+end_src
* 问题
- 当遇到编译出错时 可以试着先更新portage包
- 也可以用equery看看出错包的依赖 然后先更新那些包
* Ebuild
** 标准变量(variables)
| P                   | 软件包名称-版本 ${PN}-${PV} eg. vim-6.3                                                                                |
| PN                  | 仅包名称 eg. vim                                                                                                      |
| PV                  | 包版本 eg. 6.3                                                                                                       |
| PR                  | 修订                                                                                                                 |
| PVR                 | 版本-修订 ${PV}-${PR} eg. 6.3-r1                                                                                      |
| PF                  | 包名称-版本-修订 ${PN}-${PVR} eg. vim-6.3-r1                                                                           |
| A                   | 包所有的源代码文件(不包括USE关闭的)                                                                                      |
| CATEGORY            | 包的类别 eg. app-editors/emacs的app-editors                                                                           |
| FILESDIR            | 包目录的files/的文件 用于一些patch或者其他                                                                               |
| WORKDIR             | ebuild根构建目录的路径 eg.${PORTAGE_BUILDDIR}/work                                                                     |
| T                   | ebuild可能使用的临时目录路径 eg.${PORTAGE_BUILDDIR}/temp                                                                |
| D                   | 临时安装目录的路径 eg. ${PORTAGE_BUILDDIR}/image                                                                       |
| HOME                | 临时目录的路径 供ebuild调用的任何可你呢个读取或修改主目录的程序用 eg. ${PORTAGE_BUILDDIR}/homedir                            |
| ROOT                | 软件包要合并到根目录的绝对路径 仅在pkg_*阶段允许                                                                           |
| DISTDIR             | 包含存储为包获取的所有文件的目录的路径                                                                                    |
| EPREFIX             | PREFIX安装的规范化PREFIX前缀路径                                                                                       |
| ED                  | ${D%/}${EPREFIX}/ 的简写                                                                                             |
| EROOT               | ${ROOT%/}${EPREFIX}/ 的简写                                                                                          |
| SYSROOT             | (EAPI=7)包含构建依赖的根目录的绝对路径                                                                                   |
| ESYSROOT            | (EAPI=7)${SYSROOT%/}${EPREFIX}/ 的简写                                                                               |
| BROOT               | (EAPI=7)包含所满足的构建依赖项的根目录的绝对路径BDEPEND，通常是可执行构建工具。                                               |
| MERGE_TYPE          | 正在合并的软件包类型(类似portage feature的buildpkg): source代表源代码 binary是否安装ebuild构建的二进制包 buildonly仅构建不安装 |
| REPLACING_VERSIONS  | 此软件包的所有版本(PVR)的空格分格列表                                                                                    |
| REPLACED_BY_VERSION | 若此软件包作为安装的一部分被卸载 则返回软件版本(PVR)                                                                       |
** Ebuild定义变量
| EAPI         | EAPI版本                                                          |
| DESCRIPTION  | (必须)软件包的简短描述 <=80字                                        |
| HOMEPAGE     | (必须)软件包主页 缺省值:https://wiki.gentoo.org/wiki/No_homepage    |
| SRC_URI      | 软件包URI列表                                                      |
| LICENSE      | 许可                                                              |
| SLOT         | (必须)包的SLOT                                                     |
| KEYWORDS     | 包的keywords                                                      |
| IUSE         | ebuild中所有USE(不包括arch)                                        |
| REQUIRED_USE | 必须满足的USE                                                      |
| PROPERTIES   | 空格分格的属性列表 支持条件语法 :interactive live test_network        |
| RESTRICT     | 空格分格的要限制的portage功能列表 :fetch mirror strip test userpriv  |
| DEPEND       | 构建依赖表                                                         |
| BDEPEND      | (EAPI=7) CBUILD依赖表                                             |
| RDEPEND      | 运行时依赖表                                                       |
| PDEPEND      | 合并后要安装的包列表                                                |
| S            | 临时的构建目录路径 由src_compile,src_install使用 默认:${WORKDIR}/${P} |
| DOCS         | src_install默认安装的文档文件列表                                  |
| HTML_DOCS    | einstalldocs要递归安装的文档列表                                           |



*** SRC_URI
可以条件性的下载源码
#+begin_src shell
  SRC_URI = " https://example.com/files/${P}-core.tar.bz2
	  x86? (https://example.com/files/${P}-sse-asm.tar.bz2)
  "
#+end_src
也可以重命名
#+begin_src shell
  SRC_URI = "https://example.com/files/${PV}.tar.gz -> ${P}.tar.gz"
#+end_src
也可以定义多个下载源
#+begin_src shell
  github https://github.com https://ghproxy.net
  SRC_URI="mirror://github/${PN}/${P}.tar.gz"
#+end_src
*** REQUIRED_USE
USE关系

如果foo 则不能有bar
#+begin_src shell
  REQUIRED_USE = " foo? (!bar) "
#+end_src

如果foo 则有必须bar 或 baz 或 quux 至少一个
#+begin_src shell
  REQUIRED_USE = "foo? (|| (bar baz quux))"
#+end_src

必须foo bar gaz中至少一个
#+begin_src shell
  REQUIRED_USE = "|| (bar baz quux)"
#+end_src

必须foo bar gaz中一个 不能多
#+begin_src shell
  REQUIRED_USE = " ^^ （ foo bar baz ）"
#+end_src

必须一个或零个 不能多
#+begin_src shell
  REQUIRED_USE = " ?? (a b c)"
#+end_src
** 用户环境
