cs/gentoo/gentoo.md


<a id="org07cbeda"></a>

## packages


<a id="org11f5535"></a>

### package.use

1.  emacs

        app-editors/emacs libxml2 dynamic-loading json xwidgets

2.  ffmpeg

        media-video/ffmpeg libass opus vpx

3.  glibc

        sys-libs/glibc hash-sysv-compat

4.  qbittorrent

        net-p2p/qbittorrent gui webui

5.  wine-proton

        app-emulation/wine-proton osmesa v4l

6.  rust

        dev-lang/rust  clippy doc rust-analyzer rust-src rust-fmt
        dev-lang/rust-bin clippy rust-src rust-analyzer rustfmt

7.  gcc

        sys-devel/gcc jit

8.  libdrm

        x11-libs/libdrm video_cards_radeon

9.  obs-studio

        meida-video/obs-studio pipewire

10. pipewire

    \#+begin<sub>src</sub> shell
      media-video/pipewire gstreamer

11. librime-lua

        app-i18n/librime-lua lua_single_target_lua5-4


<a id="org36a3f34"></a>

### package.accept<sub>keywords</sub>

1.  gentoo-zh/xanmod-kernel

        sys-kernel/xanmod-kernel ~amd64


<a id="org0ff5b57"></a>

# 应该安装的包

    fcitx-gtk


<a id="orgee4e1c2"></a>

# 问题

-   当遇到编译出错时 可以试着先更新portage包
-   也可以用equery看看出错包的依赖 然后先更新那些包


<a id="org99d9fc2"></a>

# Ebuild


<a id="orgdeb829d"></a>

## 标准变量(variables)

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">P</td>
<td class="org-left">软件包名称-版本 \({PN}-\){PV} eg. vim-6.3</td>
</tr>

<tr>
<td class="org-left">PN</td>
<td class="org-left">仅包名称 eg. vim</td>
</tr>

<tr>
<td class="org-left">PV</td>
<td class="org-left">包版本 eg. 6.3</td>
</tr>

<tr>
<td class="org-left">PR</td>
<td class="org-left">修订</td>
</tr>

<tr>
<td class="org-left">PVR</td>
<td class="org-left">版本-修订 \({PV}-\){PR} eg. 6.3-r1</td>
</tr>

<tr>
<td class="org-left">PF</td>
<td class="org-left">包名称-版本-修订 \({PN}-\){PVR} eg. vim-6.3-r1</td>
</tr>

<tr>
<td class="org-left">A</td>
<td class="org-left">包所有的源代码文件(不包括USE关闭的)</td>
</tr>

<tr>
<td class="org-left">CATEGORY</td>
<td class="org-left">包的类别 eg. app-editors/emacs的app-editors</td>
</tr>

<tr>
<td class="org-left">FILESDIR</td>
<td class="org-left">包目录的files/的文件 用于一些patch或者其他</td>
</tr>

<tr>
<td class="org-left">WORKDIR</td>
<td class="org-left">ebuild根构建目录的路径 eg.${PORTAGE<sub>BUILDDIR</sub>}/work</td>
</tr>

<tr>
<td class="org-left">T</td>
<td class="org-left">ebuild可能使用的临时目录路径 eg.${PORTAGE<sub>BUILDDIR</sub>}/temp</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">临时安装目录的路径 eg. ${PORTAGE<sub>BUILDDIR</sub>}/image</td>
</tr>

<tr>
<td class="org-left">HOME</td>
<td class="org-left">临时目录的路径 供ebuild调用的任何可你呢个读取或修改主目录的程序用 eg. ${PORTAGE<sub>BUILDDIR</sub>}/homedir</td>
</tr>

<tr>
<td class="org-left">ROOT</td>
<td class="org-left">软件包要合并到根目录的绝对路径 仅在pkg<sub>*</sub>阶段允许</td>
</tr>

<tr>
<td class="org-left">DISTDIR</td>
<td class="org-left">包含存储为包获取的所有文件的目录的路径</td>
</tr>

<tr>
<td class="org-left">EPREFIX</td>
<td class="org-left">PREFIX安装的规范化PREFIX前缀路径</td>
</tr>

<tr>
<td class="org-left">ED</td>
<td class="org-left">\({D%/}\){EPREFIX}/ 的简写</td>
</tr>

<tr>
<td class="org-left">EROOT</td>
<td class="org-left">\({ROOT%/}\){EPREFIX}/ 的简写</td>
</tr>

<tr>
<td class="org-left">SYSROOT</td>
<td class="org-left">(EAPI=7)包含构建依赖的根目录的绝对路径</td>
</tr>

<tr>
<td class="org-left">ESYSROOT</td>
<td class="org-left">(EAPI=7)\({SYSROOT%/}\){EPREFIX}/ 的简写</td>
</tr>

<tr>
<td class="org-left">BROOT</td>
<td class="org-left">(EAPI=7)包含所满足的构建依赖项的根目录的绝对路径BDEPEND，通常是可执行构建工具。</td>
</tr>

<tr>
<td class="org-left">MERGE<sub>TYPE</sub></td>
<td class="org-left">正在合并的软件包类型(类似portage feature的buildpkg): source代表源代码 binary是否安装ebuild构建的二进制包 buildonly仅构建不安装</td>
</tr>

<tr>
<td class="org-left">REPLACING<sub>VERSIONS</sub></td>
<td class="org-left">此软件包的所有版本(PVR)的空格分格列表</td>
</tr>

<tr>
<td class="org-left">REPLACED<sub>BY</sub><sub>VERSION</sub></td>
<td class="org-left">若此软件包作为安装的一部分被卸载 则返回软件版本(PVR)</td>
</tr>
</tbody>
</table>


<a id="org62d426c"></a>

## Ebuild定义变量

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">EAPI</td>
<td class="org-left">EAPI版本</td>
</tr>

<tr>
<td class="org-left">DESCRIPTION</td>
<td class="org-left">(必须)软件包的简短描述 &lt;=80字</td>
</tr>

<tr>
<td class="org-left">HOMEPAGE</td>
<td class="org-left">(必须)软件包主页 缺省值:<a href="https://wiki.gentoo.org/wiki/No_homepage">https://wiki.gentoo.org/wiki/No_homepage</a></td>
</tr>

<tr>
<td class="org-left">SRC<sub>URI</sub></td>
<td class="org-left">软件包URI列表</td>
</tr>

<tr>
<td class="org-left">LICENSE</td>
<td class="org-left">许可</td>
</tr>

<tr>
<td class="org-left">SLOT</td>
<td class="org-left">(必须)包的SLOT</td>
</tr>

<tr>
<td class="org-left">KEYWORDS</td>
<td class="org-left">包的keywords</td>
</tr>

<tr>
<td class="org-left">IUSE</td>
<td class="org-left">ebuild中所有USE(不包括arch)</td>
</tr>

<tr>
<td class="org-left">REQUIRED<sub>USE</sub></td>
<td class="org-left">必须满足的USE</td>
</tr>

<tr>
<td class="org-left">PROPERTIES</td>
<td class="org-left">空格分格的属性列表 支持条件语法 :interactive live test<sub>network</sub></td>
</tr>

<tr>
<td class="org-left">RESTRICT</td>
<td class="org-left">空格分格的要限制的portage功能列表 :fetch mirror strip test userpriv</td>
</tr>

<tr>
<td class="org-left">DEPEND</td>
<td class="org-left">构建依赖表</td>
</tr>

<tr>
<td class="org-left">BDEPEND</td>
<td class="org-left">(EAPI=7) CBUILD依赖表</td>
</tr>

<tr>
<td class="org-left">RDEPEND</td>
<td class="org-left">运行时依赖表</td>
</tr>

<tr>
<td class="org-left">PDEPEND</td>
<td class="org-left">合并后要安装的包列表</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">临时的构建目录路径 由src<sub>compile,src</sub><sub>install使用</sub> 默认:\({WORKDIR}/\){P}</td>
</tr>

<tr>
<td class="org-left">DOCS</td>
<td class="org-left">src<sub>install默认安装的文档文件列表</sub></td>
</tr>

<tr>
<td class="org-left">HTML<sub>DOCS</sub></td>
<td class="org-left">einstalldocs要递归安装的文档列表</td>
</tr>
</tbody>
</table>


<a id="org9b26e57"></a>

### SRC<sub>URI</sub>

可以条件性的下载源码

    SRC_URI = " https://example.com/files/${P}-core.tar.bz2
              x86? (https://example.com/files/${P}-sse-asm.tar.bz2)
    "

也可以重命名

    SRC_URI = "https://example.com/files/${PV}.tar.gz -> ${P}.tar.gz"

也可以定义多个下载源

    github https://github.com https://ghproxy.net
    SRC_URI="mirror://github/${PN}/${P}.tar.gz"


<a id="org3451ac0"></a>

### REQUIRED<sub>USE</sub>

USE关系

如果foo 则不能有bar

    REQUIRED_USE = " foo? (!bar) "

如果foo 则有必须bar 或 baz 或 quux 至少一个

    REQUIRED_USE = "foo? (|| (bar baz quux))"

必须foo bar gaz中至少一个

    REQUIRED_USE = "|| (bar baz quux)"

必须foo bar gaz中一个 不能多

    REQUIRED_USE = " ^^ （ foo bar baz ）"

必须一个或零个 不能多

    REQUIRED_USE = " ?? (a b c)"
